In [ ]:
#                                        PANDAS PAKETİ

In [ ]:
# Pandas paketi hem yüksek performanslı hem de esnek veri analizinden doğmuştur.
# Pandasta esas olarak 2 temel veri nesnesi bulunmakta.
# 1) Seriler 2) Veri Çerçeveleri

In [3]:
#        PANDAS SERİLERİ
# Pandas serilerini endekslenmiş 1 boyutlu diziler olarak düşünebiliriz.
import pandas as pd
pandas_seri = pd.Series([5, 12, 8, 6, 9])
pandas_seri

0     5
1    12
2     8
3     6
4     9
dtype: int64

In [4]:
# Varsayılan endeksler 0 dan başlayıp ardışık olarak artar.
# Peki farklı indeks istersem;
pandas_seri1 = pd.Series([12, 8, 9, 15, 6], index=["a", "b", "c", "d", "e"])
pandas_seri1

a    12
b     8
c     9
d    15
e     6
dtype: int64

In [5]:
#     PANDAS VERİ ÇERÇEVELERİ
# Günlük çalışmalarda kullandığımız çoğu veri 2 boyutludur(satır, sütun)
# Pandas paketinde 2 boyutlu veri kümeleri Data Frame (Veri Çerçevesi) olarak isimlendirilir.
# Bir pandas DataFrame oluşturmanın farklı yöntemleri vardır.
# Bunlardan biri sözlük veri yapısını kullanmaktır.
iris_dict = {
    "Sepal_Length":[5.1, 4.9, 4.7, 4.6, 5.0, 6.7, 6.3, 6.5, 6.2, 5.9],
    "Sepal_Width":[3.5, 3.0, 3.2, 3.1, 3.6, 3.0, 2.5, 3.0, 3.4, 3.0],
    "Petal_Length":[1.4, 1.4, 1.3, 1.5, 1.4, 5.2, 5.0, 5.2, 5.4, 5.1],
    "Petal_Width":[0.2, 0.2, 0.2, 0.2, 0.2, 2.3, 1.9, 2.0, 2.3, 1.8],
    "Species"    :["setosa", "setosa", "setosa", "setosa", "setosa",
                  "virginica", "virginica", "virginica", "virginica", "virginica"]
}
import pandas as pd
iris = pd.DataFrame(iris_dict)
print(iris)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0           5.1          3.5           1.4          0.2     setosa
1           4.9          3.0           1.4          0.2     setosa
2           4.7          3.2           1.3          0.2     setosa
3           4.6          3.1           1.5          0.2     setosa
4           5.0          3.6           1.4          0.2     setosa
5           6.7          3.0           5.2          2.3  virginica
6           6.3          2.5           5.0          1.9  virginica
7           6.5          3.0           5.2          2.0  virginica
8           6.2          3.4           5.4          2.3  virginica
9           5.9          3.0           5.1          1.8  virginica

In [8]:
# Varolan bir Data Frame e sütun ekleyelim.
iris["Gözlem_No"] = 1
print(iris)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species  Gözlem_No
0           5.1          3.5           1.4          0.2     setosa          1
1           4.9          3.0           1.4          0.2     setosa          1
2           4.7          3.2           1.3          0.2     setosa          1
3           4.6          3.1           1.5          0.2     setosa          1
4           5.0          3.6           1.4          0.2     setosa          1
5           6.7          3.0           5.2          2.3  virginica          1
6           6.3          2.5           5.0          1.9  virginica          1
7           6.5          3.0           5.2          2.0  virginica          1
8           6.2          3.4           5.4          2.3  virginica          1
9           5.9          3.0           5.1          1.8  virginica          1

In [9]:
# Sözlükten veri çerçevesi üretme yöntemi günlük hayatta kullanılabilecek bir yöntem değil.
# Çok büyük verilerde bu verilerin sözlük olarak girilmesi oldukça zor.
# Günlük hayatta kullandığımız veriler genelde excel, csv formatında.
# Şimdi bir csv dosyası oluşturdum onu aktaracağım.
import pandas as pd
iris_csv = pd.read_csv("mycsv.csv")
print(iris_csv)

   Sepal Lengt  Sepal Width  Petal Length  Petal Width    Species
0            2            3             1            1     setosa
1            5            3             1            1     setosa
2            4            4             2            1     setosa
3            5            4             2            1     setosa
4            6            5             1            1     setosa
5            9            6             5            3  virginica
6           10            2             5            2  virginica
7            8            3             5            2  virginica
8           12            2             6            2  virginica
9            6            3             5            2  virginica

In [10]:
# Veri çerçevem hangi sütunlardan oluşuyor.
iris_csv.columns

Index(['Sepal Lengt', 'Sepal Width', 'Petal Length', 'Petal Width', 'Species'], dtype='object')

In [11]:
# iris_csv veri çerçevemizin sütun isimlerini değiştirelim.
iris_csv.columns = ["Taç Boy", "Taç En", "Çanak Boy", "Çanak En", "Tür"]
print(iris_csv)

   Taç Boy  Taç En  Çanak Boy  Çanak En        Tür
0        2       3          1         1     setosa
1        5       3          1         1     setosa
2        4       4          2         1     setosa
3        5       4          2         1     setosa
4        6       5          1         1     setosa
5        9       6          5         3  virginica
6       10       2          5         2  virginica
7        8       3          5         2  virginica
8       12       2          6         2  virginica
9        6       3          5         2  virginica

In [14]:
# Iris veri çerçevesinin genel yapısını .head() ile görebilirim.
iris_csv.head(6)

   Taç Boy  Taç En  Çanak Boy  Çanak En        Tür
0        2       3          1         1     setosa
1        5       3          1         1     setosa
2        4       4          2         1     setosa
3        5       4          2         1     setosa
4        6       5          1         1     setosa
5        9       6          5         3  virginica

In [15]:
# Data Frame deki son satırları görmek için .tail()
iris_csv.tail(2)

   Taç Boy  Taç En  Çanak Boy  Çanak En        Tür
8       12       2          6         2  virginica
9        6       3          5         2  virginica

In [16]:
iris_csv.shape

(10, 5)

In [18]:
iris_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Taç Boy    10 non-null     int64
 1   Taç En     10 non-null     int64
 2   Çanak Boy  10 non-null     int64
 3   Çanak En   10 non-null     int64
 4   Tür        10 non-null     object
dtypes: int64(4), object(1)
memory usage: 528.0+ bytes

In [20]:
iris_csv_copy = iris_csv.copy()
iris_csv_copy

   Taç Boy  Taç En  Çanak Boy  Çanak En        Tür
0        2       3          1         1     setosa
1        5       3          1         1     setosa
2        4       4          2         1     setosa
3        5       4          2         1     setosa
4        6       5          1         1     setosa
5        9       6          5         3  virginica
6       10       2          5         2  virginica
7        8       3          5         2  virginica
8       12       2          6         2  virginica
9        6       3          5         2  virginica

In [22]:
# !!! Pandas paketi Numpy paketi üzerinde geliştirildi.
# İstenirse bir pandas veri çerçevesini .values ile Numpy dizisine çevirebilirsin.
np_dizi = iris.values
print(np_dizi)

[[5.1 3.5 1.4 0.2 'setosa' 1]
 [4.9 3.0 1.4 0.2 'setosa' 1]
 [4.7 3.2 1.3 0.2 'setosa' 1]
 [4.6 3.1 1.5 0.2 'setosa' 1]
 [5.0 3.6 1.4 0.2 'setosa' 1]
 [6.7 3.0 5.2 2.3 'virginica' 1]
 [6.3 2.5 5.0 1.9 'virginica' 1]
 [6.5 3.0 5.2 2.0 'virginica' 1]
 [6.2 3.4 5.4 2.3 'virginica' 1]
 [5.9 3.0 5.1 1.8 'virginica' 1]]

In [5]:
# Numpy için geçerli metodları pandas veri çerçevelerine de uygulayabiliriz.
# Önce veri çerçevemin sayısal sütunlarını seçelim.
# NOT//  iloc: satır(row) ya da kolonu(column) indexlerine bagli olarak secerken
# loc: kolon ya da satir isimlerine gore secersin
import pandas as pd
import numpy as np
iris_dict = {
    "Sepal_Length":[5.1, 4.9, 4.7, 4.6, 5.0, 6.7, 6.3, 6.5, 6.2, 5.9],
    "Sepal_Width":[3.5, 3.0, 3.2, 3.1, 3.6, 3.0, 2.5, 3.0, 3.4, 3.0],
    "Petal_Length":[1.4, 1.4, 1.3, 1.5, 1.4, 5.2, 5.0, 5.2, 5.4, 5.1],
    "Petal_Width":[0.2, 0.2, 0.2, 0.2, 0.2, 2.3, 1.9, 2.0, 2.3, 1.8],
    "Species"    :["setosa", "setosa", "setosa", "setosa", "setosa",
                  "virginica", "virginica", "virginica", "virginica", "virginica"]
}
import pandas as pd
iris = pd.DataFrame(iris_dict)
dizi = iris.iloc[:, [0, 1, 2, 3]]
print(dizi)
dizi_log = np.log(dizi)
print(dizi_log.head())

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           6.7          3.0           5.2          2.3
6           6.3          2.5           5.0          1.9
7           6.5          3.0           5.2          2.0
8           6.2          3.4           5.4          2.3
9           5.9          3.0           5.1          1.8
   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0      1.629241     1.252763      0.336472    -1.609438
1      1.589235     1.098612      0.336472    -1.609438
2      1.547563     1.163151      0.262364    -1.609438
3      1.526056     1.131402      0.405465    -1.609438
4      1.609438     1.280934      0.336472    -1.609438

In [ ]:
# Pandas serileri: 1 Boyutlu           Pandas Veri Çerçeveler: 2 Boyutlu
# Pandas daha fazla boyutlu veri yapılarınada izin verir.
# Bunu pandas verilerinde çoklu indeks ekleyerek yaparız.

In [6]:
# Pandas serisine çoklu indeks ekleme:
import pandas as pd
indeks = [("ABC", 2016), ("ABC", 2017),
         ("DEF", 2016), ("DEF", 2017),
         ("XYZ", 2016), ("XYZ", 2017),
         ("KLM", 2016), ("KLM", 2017)]
fiyatlar = [25, 47, 84, 12, 65, 79, 26, 35]
hisseler = pd.Series(fiyatlar, index=indeks)
hisseler

(ABC, 2016)    25
(ABC, 2017)    47
(DEF, 2016)    84
(DEF, 2017)    12
(XYZ, 2016)    65
(XYZ, 2017)    79
(KLM, 2016)    26
(KLM, 2017)    35
dtype: int64

In [8]:
# Çoklu indeks kullanmanın daha etkin bir yolu;
indeks =pd.MultiIndex.from_tuples(indeks)
hisseler = pd.Series(fiyatlar, index=indeks)
hisseler

ABC  2016    25
     2017    47
DEF  2016    84
     2017    12
XYZ  2016    65
     2017    79
KLM  2016    26
     2017    35
dtype: int64

In [11]:
# İndeksleri isimlendirmekte mümkün;
hisseler.index.names = ["Hisse", "Yıl"]
hisseler

Hisse  Yıl
ABC    2016    25
       2017    47
DEF    2016    84
       2017    12
XYZ    2016    65
       2017    79
KLM    2016    26
       2017    35
dtype: int64

In [12]:
# Yukarıdaki hisseler verisi bir boyutlu. !!! Bir seriyi .unstack() metodu ile data frame e çevirebilirsin.
hisseler.unstack()
# .stack() ile tekrar eski haline çevirebilirsin!

Yıl    2016  2017
Hisse
ABC      25    47
DEF      84    12
KLM      26    35
XYZ      65    79

In [18]:
# Satırlar için çoklu indeks yapabildiğimiz gibi sütunlar içinde yapabiliriz.
my_indeks  = pd.MultiIndex.from_product([["ABC", "DEF", "KLM"], [2016, 2017]])
columns = pd.MultiIndex.from_product([["Q1", "Q2", "Q3", "Q4"], ["Hacim", "Kapanış"]])
data = np.array([1072.5, 32.4, 12688, 34, 13689, 35.2, 18414, 37.4,
               10688, 12.3, 14348, 13.2, 15924, 15.3, 15244, 18,
                14844, 24.7, 14999, 22.5, 13099, 19.2, 17555, 15.5,
                15606, 18.5, 16166, 13.4, 10627, 15.8, 13396, 15.4,
                12656, 20.6, 17485, 21.5, 18965, 22.4, 15785, 23.5,
                13206, 7.5, 10656, 7.6, 15223, 8.6, 18320, 9.4])
data = np.reshape(data, (6, 8))
my_hisseler = pd.DataFrame(data, index=my_indeks, columns=columns)
my_hisseler

               Q1               Q2               Q3               Q4
            Hacim Kapanış    Hacim Kapanış    Hacim Kapanış    Hacim Kapanış
ABC 2016   1072.5    32.4  12688.0    34.0  13689.0    35.2  18414.0    37.4
    2017  10688.0    12.3  14348.0    13.2  15924.0    15.3  15244.0    18.0
DEF 2016  14844.0    24.7  14999.0    22.5  13099.0    19.2  17555.0    15.5
    2017  15606.0    18.5  16166.0    13.4  10627.0    15.8  13396.0    15.4
KLM 2016  12656.0    20.6  17485.0    21.5  18965.0    22.4  15785.0    23.5
    2017  13206.0     7.5  10656.0     7.6  15223.0     8.6  18320.0     9.4

In [20]:
# Bir veri çerçevesinde herhangi bir sütunu görmek için; data_frame["sütun_ismi"]
print(iris)
iris["Sepal_Length"]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0           5.1          3.5           1.4          0.2     setosa
1           4.9          3.0           1.4          0.2     setosa
2           4.7          3.2           1.3          0.2     setosa
3           4.6          3.1           1.5          0.2     setosa
4           5.0          3.6           1.4          0.2     setosa
5           6.7          3.0           5.2          2.3  virginica
6           6.3          2.5           5.0          1.9  virginica
7           6.5          3.0           5.2          2.0  virginica
8           6.2          3.4           5.4          2.3  virginica
9           5.9          3.0           5.1          1.8  virginica

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
5    6.7
6    6.3
7    6.5
8    6.2
9    5.9
Name: Sepal_Length, dtype: float64

In [21]:
# NOT!! Veri setindeki veriyi [sütun_ismi] şeklinde kullarnırsan çıktıyı tek boyutlu olan seri olarak alırsın.
# [[sütun_ismi]] şeklinde kullanırsan çıktıyı data frame olarak alalım.
iris[["Sepal_Length"]]

   Sepal_Length
0           5.1
1           4.9
2           4.7
3           4.6
4           5.0
5           6.7
6           6.3
7           6.5
8           6.2
9           5.9

In [22]:
iris[["Sepal_Length", "Sepal_Width"]]

   Sepal_Length  Sepal_Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6
5           6.7          3.0
6           6.3          2.5
7           6.5          3.0
8           6.2          3.4
9           5.9          3.0

In [23]:
# Satır seçelim;
iris[2: 5]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [24]:
shares_csv = pd.read_csv("sharescsv.csv", index_col=0)
shares_csv

     acilis  en_dusuk  en_yuksek  kapanis
ABC    3.25      3.15       3.50     3.15
DEF    5.40      5.00       6.00     6.00
KLM   15.75     15.25      16.75    16.50
XYZ   80.20     75.00      85.25    84.30
IJK   17.50     16.00      19.00    18.20
VYZ   25.70     24.10      27.50    26.80
ERN   95.00     90.20      99.50    97.50
HEA   55.00     53.00      57.40    59.30

In [25]:
shares_csv.loc["IJK"]

acilis       17.5
en_dusuk     16.0
en_yuksek    19.0
kapanis      18.2
Name: IJK, dtype: float64

In [26]:
shares_csv.loc[["IJK"]]

     acilis  en_dusuk  en_yuksek  kapanis
IJK    17.5      16.0       19.0     18.2

In [27]:
shares_csv.loc[["ERN", "ABC"]]

     acilis  en_dusuk  en_yuksek  kapanis
ERN   95.00     90.20       99.5    97.50
ABC    3.25      3.15        3.5     3.15

In [28]:
shares_csv["acilis"]["ERN"]
# Aynı seçimi şu şekildede yapabilirsin--> shares_csv.acilis["ERN"]

95.0

In [31]:
shares_csv.loc[["KLM", "VYZ"],["en_dusuk", "en_yuksek"]]

     en_dusuk  en_yuksek
KLM     15.25      16.75
VYZ     24.10      27.50

In [33]:
shares_csv.loc[:, ["en_dusuk", "en_yuksek"]]

     en_dusuk  en_yuksek
ABC      3.15       3.50
DEF      5.00       6.00
KLM     15.25      16.75
XYZ     75.00      85.25
IJK     16.00      19.00
VYZ     24.10      27.50
ERN     90.20      99.50
HEA     53.00      57.40

In [34]:
# Satır ve sütun isimleri yerine indeks no ile seçim yapmak için iloc kullanılır.
shares_csv.iloc[1]

acilis       5.4
en_dusuk     5.0
en_yuksek    6.0
kapanis      6.0
Name: DEF, dtype: float64

In [35]:
shares_csv.iloc[[1, 2, 3], [2, 3]]

     en_yuksek  kapanis
DEF       6.00      6.0
KLM      16.75     16.5
XYZ      85.25     84.3

In [36]:
shares_csv["kapanis"][0:4]

ABC     3.15
DEF     6.00
KLM    16.50
XYZ    84.30
Name: kapanis, dtype: float64

In [37]:
# tersten yazdıralım;
shares_csv.loc["KLM":"ABC":-1]

     acilis  en_dusuk  en_yuksek  kapanis
KLM   15.75     15.25      16.75    16.50
DEF    5.40      5.00       6.00     6.00
ABC    3.25      3.15       3.50     3.15

In [38]:
# Peki pandas data frame e for döngüsü uygularsam ne olur?
for i in shares_csv:
    print(i)

acilis
en_dusuk
en_yuksek
kapanis

In [39]:
# Bilgilere ulaşabilmek için .iterrows metodu kullanılır.
for hisseler, satır in shares_csv.iterrows():
    print(hisseler)
    print(satır)

ABC
acilis       3.25
en_dusuk     3.15
en_yuksek    3.50
kapanis      3.15
Name: ABC, dtype: float64
DEF
acilis       5.4
en_dusuk     5.0
en_yuksek    6.0
kapanis      6.0
Name: DEF, dtype: float64
KLM
acilis       15.75
en_dusuk     15.25
en_yuksek    16.75
kapanis      16.50
Name: KLM, dtype: float64
XYZ
acilis       80.20
en_dusuk     75.00
en_yuksek    85.25
kapanis      84.30
Name: XYZ, dtype: float64
IJK
acilis       17.5
en_dusuk     16.0
en_yuksek    19.0
kapanis      18.2
Name: IJK, dtype: float64
VYZ
acilis       25.7
en_dusuk     24.1
en_yuksek    27.5
kapanis      26.8
Name: VYZ, dtype: float64
ERN
acilis       95.0
en_dusuk     90.2
en_yuksek    99.5
kapanis      97.5
Name: ERN, dtype: float64
HEA
acilis       55.0
en_dusuk     53.0
en_yuksek    57.4
kapanis      59.3
Name: HEA, dtype: float64

In [40]:
for hisse, satır in shares_csv.iterrows():
    print(hisse , ":", satır["kapanis"])

ABC : 3.15
DEF : 6.0
KLM : 16.5
XYZ : 84.3
IJK : 18.2
VYZ : 26.8
ERN : 97.5
HEA : 59.3

In [42]:
# For döngüsünü kullanarak veri çerçeveme yeni bir sütun ekleyeceğim.
for hisse, satır in shares_csv.iterrows():
    shares_csv.loc[hisse, "gunluk_fark"] = satır["kapanis"] - satır["acilis"]
print(shares_csv)
# Tabi bunu daha kısa bir şekilde halledebiliriz.
# shares_csv["gunluk_fark"] = shares_csv["kapanis"] - shares_csv["acilis"]

     acilis  en_dusuk  en_yuksek  kapanis  gunluk_fark
ABC    3.25      3.15       3.50     3.15        -0.10
DEF    5.40      5.00       6.00     6.00         0.60
KLM   15.75     15.25      16.75    16.50         0.75
XYZ   80.20     75.00      85.25    84.30         4.10
IJK   17.50     16.00      19.00    18.20         0.70
VYZ   25.70     24.10      27.50    26.80         1.10
ERN   95.00     90.20      99.50    97.50         2.50
HEA   55.00     53.00      57.40    59.30         4.30

In [44]:
# !! Bir veri kümesi ile çalııışmadan önce ilk  olarak verilerin özelliklerine bakılır.
import pandas as pd
iris.describe()

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count     10.000000    10.000000     10.000000    10.000000
mean       5.590000     3.130000      3.290000     1.130000
std        0.807534     0.316403      1.995244     0.992248
min        4.600000     2.500000      1.300000     0.200000
25%        4.925000     3.000000      1.400000     0.200000
50%        5.500000     3.050000      3.250000     1.000000
75%        6.275000     3.350000      5.175000     1.975000
max        6.700000     3.600000      5.400000     2.300000

In [48]:
iris["Sepal_Length"].describe()

count    10.000000
mean      5.590000
std       0.807534
min       4.600000
25%       4.925000
50%       5.500000
75%       6.275000
max       6.700000
Name: Sepal_Length, dtype: float64

In [50]:
# Bir sütunda hangi kategorik değişkenlerin yer aldını anlamak için .unique()
iris["Species"].unique()

array(['setosa', 'virginica'], dtype=object)

In [52]:
# İstersen ayrı ayrıda bakabilirsin;
# Ortalama --> .mean()  Standart Sapma --> .std()
# Medyan --> .median()   Yüzdelik Dilim --> .quantile()
iris["Sepal_Length"].max()

6.7

In [53]:
# Bu metodları satırlarada uygulayabilirsin!
iris.mean(axis="columns")

0    2.550
1    2.375
2    2.350
3    2.350
4    2.550
5    4.300
6    3.925
7    4.175
8    4.325
9    3.950
dtype: float64

In [54]:
iris[iris["Species"] == "virginica"].describe()

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count      5.000000     5.000000      5.000000     5.000000
mean       6.320000     2.980000      5.180000     2.060000
std        0.303315     0.319374      0.148324     0.230217
min        5.900000     2.500000      5.000000     1.800000
25%        6.200000     3.000000      5.100000     1.900000
50%        6.300000     3.000000      5.200000     2.000000
75%        6.500000     3.000000      5.200000     2.300000
max        6.700000     3.400000      5.400000     2.300000

In [56]:
iris[iris["Sepal_Length"] > 6]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
5           6.7          3.0           5.2          2.3  virginica
6           6.3          2.5           5.0          1.9  virginica
7           6.5          3.0           5.2          2.0  virginica
8           6.2          3.4           5.4          2.3  virginica

In [61]:
iris[(iris["Sepal_Width"] > 3)&(iris["Sepal_Length"]>5)]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0           5.1          3.5           1.4          0.2     setosa
8           6.2          3.4           5.4          2.3  virginica

In [63]:
iris["Petal_Length"][iris["Sepal_Width"]>3]

0    1.4
2    1.3
3    1.5
4    1.4
8    5.4
Name: Petal_Length, dtype: float64

In [ ]:
# Hiç 0 içermeyen sütunları görmek için .all() metodu
# Sıfırdan farklı değerler içeren sütunları görmek içn .any()
# NaN(Sayı olmama durumu) içeren  sütunları görmek için .isnull() içermeyenleri görmek için .notnull()

In [1]:
# Yeniden şekillendirme işlemi yapacağız.
# Yeni bir dataframe oluşturalım;
import numpy as np
import pandas as pd
degisken = np.repeat(["A", "B", "C", "D"], [3, 3, 3, 3])
deger = np.random.random(12)
df_dict = {"degisken": degisken, "deger": deger}
df = pd.DataFrame(df_dict)
df = df[["degisken", "deger"]]
print(df)

   degisken     deger
0         A  0.897291
1         A  0.743257
2         A  0.953106
3         B  0.868834
4         B  0.936711
5         B  0.454891
6         C  0.319591
7         C  0.748960
8         C  0.986292
9         D  0.168456
10        D  0.042562
11        D  0.852047

In [4]:
# Data Frame in yapısını .pivot() metodu ile değiştirelim;
df2 = df.pivot(columns="degisken", values="deger")
print(df2)

degisken         A         B         C         D
0         0.897291       NaN       NaN       NaN
1         0.743257       NaN       NaN       NaN
2         0.953106       NaN       NaN       NaN
3              NaN  0.868834       NaN       NaN
4              NaN  0.936711       NaN       NaN
5              NaN  0.454891       NaN       NaN
6              NaN       NaN  0.319591       NaN
7              NaN       NaN  0.748960       NaN
8              NaN       NaN  0.986292       NaN
9              NaN       NaN       NaN  0.168456
10             NaN       NaN       NaN  0.042562
11             NaN       NaN       NaN  0.852047

In [7]:
# Tekrar eski haline çevirelim;
df3 = df2.melt(value_vars=["A", "B", "C", "D"], value_name="deger").dropna()  # Null yani Nan değerlere sahip satırları kaldırmak için kullanılır. Bu işlem yeni bir Dataframe döndürür.
# ve kaynak DataFrame değişmez.
print(df3)

   degisken     deger
0         A  0.897291
1         A  0.743257
2         A  0.953106
15        B  0.868834
16        B  0.936711
17        B  0.454891
30        C  0.319591
31        C  0.748960
32        C  0.986292
45        D  0.168456
46        D  0.042562
47        D  0.852047

In [16]:
# 2 tane yeni veri çerçevesi oluşturağım.
df1 = pd.read_csv("data_frame1.csv")
df2 = pd.read_csv("data_frame2.csv")
print(df1)
print(df2)

       X  Y1
0  Hasan  97
1   Erol  85
2  Hülya  75
        X  Y1
0   Hasan  75
1    Erol  94
2  Egemen  96

In [17]:
# 2 Data Frame i birleştirirken kullanabileceğimz yöntemler left, right, inner ve outer yöntemleridir.
# Anahtar bir sütun kullanarak birleştirmek için .merge() metodu kullanılır.
df_left = pd.merge(df1, df2, how="left", on= "X")
print(df_left)

       X  Y1_x  Y1_y
0  Hasan    97  75.0
1   Erol    85  94.0
2  Hülya    75   NaN

In [18]:
df_right = pd.merge(df1, df2, how="right", on="X")
print(df_right)

        X  Y1_x  Y1_y
0   Hasan  97.0    75
1    Erol  85.0    94
2  Egemen   NaN    96

In [20]:
# inner de ortaklar baz alınarak birleştirme yapılır.
df_inner = pd.merge(df1, df2, how="inner", on="X")
print(df_inner)

       X  Y1_x  Y1_y
0  Hasan    97    75
1   Erol    85    94

In [21]:
df_outer = pd.merge(df1, df2, how="outer", on="X")
print(df_outer)
# Tüm satırlar birleştirilir.

        X  Y1_x  Y1_y
0   Hasan  97.0  75.0
1    Erol  85.0  94.0
2   Hülya  75.0   NaN
3  Egemen   NaN  96.0